src/sched/bpf/mutants/first_only.patch
# first_only: a policy the contracts must reject.
#
# Give up after the first busy CPU when its queue reads empty or the move
# fails.
#
# CFS's load balancer picks one busiest candidate per pass and stops;
# Ipanema's `steal_for` goes on to the next core, and the exhaustive scan is
# what the theorem's "no CPU overloaded" conclusion rests on. A count is
# stale by the time the move is attempted, so a scan that stops at the first
# candidate can end idle beside an overloaded CPU it never read. The
# dispatch contract accepts an idle exit only with the scan past the last
# CPU and the own word written free; the loop invariant fails at the break,
# and no invariant would make the postcondition hold there.
#
--- bpf/main.rs
+++ bpf/main.rs
@@ -333,14 +333,16 @@
                                  refine::dsp_run(cpu as int, refine::tail_of(pre, log.ops@))),
             decreases n - c,
         {
-            if c != me
-                && self.words.is_busy(c as usize, log)
-                && scx::dsq_nr_queued(c as u64, log) > 0
-                && scx::dsq_move_to_local(c as u64, log)
-            {
-                self.words.unpromise(c as usize, log);
-                self.stats.inc(STEAL);
-                return;
+            if c != me && self.words.is_busy(c as usize, log) {
+                if scx::dsq_nr_queued(c as u64, log) > 0
+                    && scx::dsq_move_to_local(c as u64, log)
+                {
+                    self.words.unpromise(c as usize, log);
+                    self.stats.inc(STEAL);
+                    return;
+                }
+                // One busy CPU with nothing to give: stop looking.
+                break;
             }
             c = c + 1;
         }
