src/sched/bpf/mutants/late_publish.patch
# late_publish: a policy the contracts must reject.
#
# Bump the published count after the kernel's idle search instead of
# before it.
#
# The count is what an idle CPU reads in `update_idle`, and the interlock
# is that either the enqueue's search sees the idle bit or the idle CPU's
# read sees the count. Published after the search, a CPU whose bit went up
# during the search reads zero and stays idle while the task is filed on a
# busy queue. Ipanema's `cload` is bumped before the thread is added for
# the same reason. The automaton allows no `SelectDfl` before `CountInc`.
#
--- bpf/main.rs
+++ bpf/main.rs
@@ -206,8 +206,8 @@
             scx::dsq_insert_vtime(&p, SCX_DSQ_GLOBAL, SCX_SLICE_DFL, vtime, enq_flags, log);
             return;
         }
-        self.nr_queued.inc(log);
         let (target, is_idle) = scx::select_cpu_dfl(&p, cpu, 0, log);
+        self.nr_queued.inc(log);
         if !is_idle {
             // Nothing idle when the kernel looked: the CPU it woke on.
             self.stats.inc(PLACE_BUSY);
