src/sched/bpf/mutants/steal_idle.patch
# steal_idle: a policy the contracts must reject.
#
# Steal from any CPU with a task queued, whether or not it is running one.
#
# The model's counterexample: a task filed on an idle CPU whose kick is in
# flight is stolen away; a second task placed behind it lands on a CPU whose
# kick was already spent, and waits. Ipanema's `can_steal_core` takes only
# from an overloaded core, and the dispatch automaton reads a queue count
# only after the same CPU's word read busy.
#
--- bpf/main.rs
+++ bpf/main.rs
@@ -334,7 +334,6 @@
             decreases n - c,
         {
             if c != me
-                && self.words.is_busy(c as usize, log)
                 && scx::dsq_nr_queued(c as u64, log) > 0
                 && scx::dsq_move_to_local(c as u64, log)
             {
