src/sched/bpf/mutants/steal_idle.patch
# steal_idle: a policy the contracts must reject.
#
# Steal from any CPU with a task queued, whether or not it is running one.
#
# The model's counterexample: a task filed on an idle CPU whose kick is in
# flight is stolen away; a second task placed behind it lands on a CPU whose
# kick was already spent, and waits. Ipanema's `can_steal_core` takes only
# from an overloaded core, and the dispatch automaton reads a queue count
# only after a busy read of the same CPU came back true.
#
--- bpf/main.rs
+++ bpf/main.rs
@@ -270,7 +270,6 @@
             decreases n - c,
         {
             if c != cpu as u32
-                && self.busy.get(c as usize, log)
                 && scx::dsq_nr_queued(c as u64, log) > 0
                 && scx::dsq_move_to_local(c as u64, log)
             {
