src/sched/bpf/mutants/unchecked_claim.patch
# unchecked_claim: a policy the contracts must reject.
#
# Take the kernel's pick without reading its queue first.
#
# The model's counterexample: filing on another CPU's queue takes no lock
# of that CPU, so a task can land there between that CPU's failed dispatch
# and its idle bit going up. A claimed CPU can therefore already have work;
# a second task filed behind it waits out a slice while a third CPU idles.
# The automaton allows the compare-and-swap only after a `NrQueued` of
# that CPU read zero.
#
--- bpf/main.rs
+++ bpf/main.rs
@@ -221,7 +221,6 @@
         // from the search after a successful `init`; it is kicked all the
         // same.
         if (target as u32) < n
-            && scx::dsq_nr_queued(target as u64, log) <= 0
             && self.words.promise(target as usize, log)
         {
             self.stats.inc(PLACE_IDLE);
